; domain
(define (domain vincentland)
    (:requirements :action-costs)
    (:predicates
        (location ?l)
        (item ?i)
        (information ?info)
        (character ?c)
        (defended ?c)
        (sneaky ?c)
        (has ?cl ?i)
        (at ?c ?l)
        (player ?p)
        (cooperative ?c)
        (wants ?c ?i)
        (dead ?c)
        (weapon ?w)
        (adjacent ?la ?lb)
        (monster ?m)
        (captive ?captor ?captive)
        (damaged ?i)
        (experimented ?i)
        (explored ?l)
        (used ?i))

    (:functions
        (total-cost))

    (:action capture
        :parameters (?p ?char ?loc)
        :precondition (and (player ?p) (character ?char) (location ?loc) (at ?p ?loc) (at ?char ?loc))
        :effect (and (captive ?p ?char) (increase (total-cost) 2)))

    (:action damage
        :parameters (?p ?i ?loc ?w)
        :precondition (and (player ?p) (item ?i) (location ?loc) (weapon ?w) (or (and (at ?p ?loc) (has ?loc ?i)) (has ?p ?i)) (has ?p ?w))
        :effect (and (damaged ?i) (increase (total-cost) 1)))

    (:action defend
        :parameters (?p ?todefend ?loc)
        :precondition (and (player ?p) (or (character ?todefend) (item ?todefend)) (location ?loc) (at ?p ?loc) (or (at ?todefend ?loc) (has ?loc ?todefend)))
        :effect (and (defended ?todefend) (increase (total-cost) 1)))

    (:action escort
        :parameters (?p ?charA ?locA ?locB)
        :precondition (and (player ?p) (character ?charA) (location ?locA) (location ?locB) (at ?p ?locA) (at ?charA ?locA) (cooperative ?charA))
        :effect (and (at ?p ?locB) (at ?charA ?locB) (not (at ?p ?locA)) (not (at ?charA ?locA)) (increase (total-cost) 4)))

    (:action exchange
        :parameters (?p ?char ?i2 ?i1 ?loc)
        :precondition (and (player ?p) (character ?char) (item ?i1) (item ?i2) (location ?loc) (has ?p ?i1) (has ?char ?i2) (at ?p ?loc) (at ?char ?loc))
        :effect (and (not (has ?p ?i1)) (has ?p ?i2) (not (has ?char ?i2)) (has ?char ?i1) (increase (total-cost) 2)))

    (:action experiment
        :parameters (?p ?i)
        :precondition (and (player ?p) (item ?i) (has ?p ?i))
        :effect (and (experimented ?i) (increase (total-cost) 2)))

    (:action explore
        :parameters (?p ?locA ?locB)
        :precondition (and (player ?p) (location ?locA) (location ?locB) (at ?p ?locA))
        :effect (and (explored ?locB) (not (at ?p ?locA)) (at ?p ?locB) (increase (total-cost) 3)))

    (:action getfromlocation
        :parameters (?p ?loc ?i)
        :precondition (and (player ?p) (location ?loc) (item ?i) (has ?loc ?i) (at ?p ?loc))
        :effect (and (has ?p ?i) (not (has ?loc ?i)) (increase (total-cost) 2)))

    (:action giveto
        :parameters (?p ?charB ?i ?loc)
        :precondition (and (character ?charB) (player ?p) (item ?i) (has ?p ?i) (location ?loc) (at ?charB ?loc) (at ?p ?loc))
        :effect (and (has ?charB ?i) (not (has ?p ?i)) (cooperative ?charB) (increase (total-cost) 2)))

    (:action move
        :parameters (?p ?to ?from)
        :precondition (and (location ?to) (location ?from) (player ?p) (at ?p ?from))
        :effect (and (at ?p ?to) (not (at ?p ?from)) (increase (total-cost) 2)))

    (:action kill
        :parameters (?p ?charA ?i ?loc ?w)
        :precondition (and (not (damaged ?w)) (player ?p) (or (character ?charA) (monster ?charA)) (at ?charA ?loc) (at ?p ?loc) (item ?i) (location ?loc) (has ?charA ?i) (weapon ?w) (has ?p ?w))
        :effect (and (not (character ?charA)) (has ?loc ?i) (dead ?charA) (item ?charA) (increase (total-cost) 2)))

    (:action listen
        :parameters (?p ?char ?loc ?info)
        :precondition (and (player ?p) (character ?char) (location ?loc) (at ?p ?loc) (at ?char ?loc) (information ?info) (has ?char ?info))
        :effect (and (has ?p ?info) (increase (total-cost) 2)))

    (:action read
        :parameters (?p ?loc ?i ?info)
        :precondition (and (player ?p) (item ?i) (information ?info) (location ?loc) (at ?p ?loc) (has ?loc ?i) (has ?i ?info))
        :effect (and (has ?p ?info) (increase (total-cost) 2)))

    (:action repair
        :parameters (?p ?loc ?i)
        :precondition (and (player ?p) (location ?loc) (item ?i) (damaged ?i) (or (and (at ?p ?loc) (has ?loc ?i))) (has ?p ?i))
        :effect (and (not (damaged ?i)) (increase (total-cost) 2)))


    (:action report
        :parameters (?p ?char ?info ?loc)
        :precondition (and (player ?p) (location ?loc) (character ?char) (information ?info) (at ?p ?loc) (at ?char ?loc) (has ?p ?info))
        :effect (and (has ?char ?info) (increase (total-cost) 1)))


    (:action spy
        :parameters (?p ?char ?loc ?info)
        :precondition (and (player ?p) (character ?char) (location ?loc) (at ?p ?loc) (at ?char ?loc) (sneaky ?p) (information ?info) (has ?char ?info))
        :effect (and (has ?p ?info) (increase (total-cost) 2)))


    (:action stealth
        :parameters (?p)
        :precondition (player ?p)
        :effect (and (sneaky ?p) (increase (total-cost) 2)))


    (:action take
        :parameters (?p ?char ?i2 ?loc)
        :precondition (and (player ?p) (or (character ?char) (monster ?char)) (item ?i2) (location ?loc) (has ?char ?i2) (at ?p ?loc) (at ?char ?loc) (or (cooperative ?char) (sneaky ?p)))
        :effect (and (has ?p ?i2) (not (has ?char ?i2)) (increase (total-cost) 1)))

    (:action use
        :parameters (?p ?i)
        :precondition (and (player ?p) (item ?i) (has ?p ?i))
        :effect (and (used ?i) (increase (total-cost) 2)))

)

; problem
(define (problem guard)
(:domain vincentland)
(:objects daughter field troll hammer blacksmith ore shop wolf lumberjack cave secret you baker king village castle gel wheat fireball forest bakery guard slime sword pelt spellbook forge merchant )
(:init (has field wheat)
(at king field)
(character daughter)
(weapon sword)
(has king secret)
(has castle spellbook)
(adjacent village field)
(adjacent village forge)
(adjacent field cave)
(character blacksmith)
(item ore)
(has troll hammer)
(has cave ore)
(character guard)
(at daughter cave)
(information secret)
(location forest)
(adjacent castle village)
(at slime village)
(at merchant shop)
(location forge)
(at guard shop)
(item hammer)
(item gel)
(character lumberjack)
(monster wolf)
(= (total-cost) 0)
(has you fireball)
(weapon hammer)
(location cave)
(location castle)
(location shop)
(item sword)
(has spellbook fireball)
(item spellbook)
(adjacent village bakery)
(character baker)
(character king)
(item pelt)
(has king fireball)
(at blacksmith forge)
(has you sword)
(cooperative baker)
(location village)
(at baker bakery)
(location bakery)
(at wolf village)
(has slime gel)
(adjacent village shop)
(character merchant)
(has blacksmith hammer)
(captive troll daughter)
(information fireball)
(location field)
(has wolf pelt)
(monster slime)
(adjacent village forest)
(player you)
(at lumberjack village)
(at you field)
(item wheat)
(at troll village)
(monster troll)
)
(:goal (and (defended ore) (defended merchant) (has merchant pelt)))
(:metric minimize (total-cost)))

; plan
1. (stealth you)
   added: (sneaky you)
   goals met: 0 of 3
2. (move you village field)
   deleted: (at you field)
   added: (at you village)
   goals met: 0 of 3
3. (take you wolf pelt village)
   deleted: (has wolf pelt)
   added: (has you pelt)
   goals met: 0 of 3
4. (move you shop village)
   deleted: (at you village)
   added: (at you shop)
   goals met: 0 of 3
5. (giveto you merchant pelt shop)
   deleted: (has you pelt)
   added: (has merchant pelt) (cooperative merchant)
   goals met: 1 of 3
6. (defend you merchant shop)
   added: (defended merchant)
   goals met: 2 of 3
7. (move you cave shop)
   deleted: (at you shop)
   added: (at you cave)
   goals met: 2 of 3
8. (defend you ore cave)
   added: (defended ore)
   goals met: 3 of 3
